In [44]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [45]:
data = pd.read_csv('daily_csv.csv')

In [46]:
data

            Date  Price
0     1997-01-07   3.82
1     1997-01-08   3.80
2     1997-01-09   3.61
3     1997-01-10   3.92
4     1997-01-13   4.00
...          ...    ...
5913  2020-07-08   1.78
5914  2020-07-09   1.88
5915  2020-07-10   1.79
5916  2020-07-13   1.75
5917  2020-07-14   1.74

[5918 rows x 2 columns]

In [47]:
import seaborn as sns

In [50]:
new = data["Date"].str.split("-", n = 1, expand = True)
data["year"]= new[0]
data["month"]= new[1]
data

            Date  Price      y  year  month
0     1997-01-07   3.82  01-07  1997  01-07
1     1997-01-08   3.80  01-08  1997  01-08
2     1997-01-09   3.61  01-09  1997  01-09
3     1997-01-10   3.92  01-10  1997  01-10
4     1997-01-13   4.00  01-13  1997  01-13
...          ...    ...    ...   ...    ...
5913  2020-07-08   1.78  07-08  2020  07-08
5914  2020-07-09   1.88  07-09  2020  07-09
5915  2020-07-10   1.79  07-10  2020  07-10
5916  2020-07-13   1.75  07-13  2020  07-13
5917  2020-07-14   1.74  07-14  2020  07-14

[5918 rows x 5 columns]

In [53]:
cols = ['Date']
data=data.drop(cols,axis=1)

In [54]:
data

      Price      y  year  month
0      3.82  01-07  1997  01-07
1      3.80  01-08  1997  01-08
2      3.61  01-09  1997  01-09
3      3.92  01-10  1997  01-10
4      4.00  01-13  1997  01-13
...     ...    ...   ...    ...
5913   1.78  07-08  2020  07-08
5914   1.88  07-09  2020  07-09
5915   1.79  07-10  2020  07-10
5916   1.75  07-13  2020  07-13
5917   1.74  07-14  2020  07-14

[5918 rows x 4 columns]

In [55]:
cols=['y']
data=data.drop(cols,axis=1)

In [56]:
data

      Price  year  month
0      3.82  1997  01-07
1      3.80  1997  01-08
2      3.61  1997  01-09
3      3.92  1997  01-10
4      4.00  1997  01-13
...     ...   ...    ...
5913   1.78  2020  07-08
5914   1.88  2020  07-09
5915   1.79  2020  07-10
5916   1.75  2020  07-13
5917   1.74  2020  07-14

[5918 rows x 3 columns]

In [57]:
new = data["month"].str.split("-", n = 1, expand = True)
data["day"]= new[0]
data["mon"]= new[1]
data

      Price  year  month day mon
0      3.82  1997  01-07  01  07
1      3.80  1997  01-08  01  08
2      3.61  1997  01-09  01  09
3      3.92  1997  01-10  01  10
4      4.00  1997  01-13  01  13
...     ...   ...    ...  ..  ..
5913   1.78  2020  07-08  07  08
5914   1.88  2020  07-09  07  09
5915   1.79  2020  07-10  07  10
5916   1.75  2020  07-13  07  13
5917   1.74  2020  07-14  07  14

[5918 rows x 5 columns]

In [58]:
col=['month']
data=data.drop(col,axis=1)

In [59]:
data

      Price  year day mon
0      3.82  1997  01  07
1      3.80  1997  01  08
2      3.61  1997  01  09
3      3.92  1997  01  10
4      4.00  1997  01  13
...     ...   ...  ..  ..
5913   1.78  2020  07  08
5914   1.88  2020  07  09
5915   1.79  2020  07  10
5916   1.75  2020  07  13
5917   1.74  2020  07  14

[5918 rows x 4 columns]

In [62]:
data.isnull().any()

Price     True
year     False
day      False
mon      False
dtype: bool

In [63]:
data['Price'].fillna(data['Price'].mean(),inplace=True)

In [64]:
data.isnull().any()

Price    False
year     False
day      False
mon      False
dtype: bool

In [68]:
y=data.loc[:,data.columns=='Price'].values
y

array([[3.82],
       [3.8 ],
       [3.61],
       ...,
       [1.79],
       [1.75],
       [1.74]])

In [69]:
x=data.loc[:,data.columns!='Price'].values
x

array([['1997', '01', '07'],
       ['1997', '01', '08'],
       ['1997', '01', '09'],
       ...,
       ['2020', '07', '10'],
       ['2020', '07', '13'],
       ['2020', '07', '14']], dtype=object)

In [70]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x=sc.fit_transform(x)
x

array([[-1.66518098, -1.59751007, -0.9962194 ],
       [-1.66518098, -1.59751007, -0.88179454],
       [-1.66518098, -1.59751007, -0.76736968],
       ...,
       [ 1.71585403,  0.15638232, -0.65294483],
       [ 1.71585403,  0.15638232, -0.30967025],
       [ 1.71585403,  0.15638232, -0.19524539]])

In [78]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.20,random_state=0)

In [79]:
from sklearn.ensemble import RandomForestRegressor
Rf=RandomForestRegressor(n_estimators=10,random_state=0,n_jobs=-1)
Rf.fit(x_train,y_train)

C:\Users\Sashank Varma\anaconda3\lib\site-packages\ipykernel_launcher.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  This is separate from the ipykernel package so we can avoid doing imports until

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=10, n_jobs=-1, oob_score=False,
                      random_state=0, verbose=0, warm_start=False)

In [80]:
y_pred=Rf.predict(x_test)

In [81]:
y_pred

array([3.058, 4.534, 7.374, ..., 2.285, 3.117, 7.94 ])

In [82]:
y_test

array([[3.01],
       [4.53],
       [7.04],
       ...,
       [2.28],
       [3.09],
       [8.1 ]])

In [83]:
from sklearn.metrics import r2_score

In [84]:
r2_score(y_pred,y_test)

0.9880390477657343